app/controllers/reps_controller.rb

  def show
    render json: Rep.find(params[:id])
---
SELECT  "reps".* FROM "reps" WHERE "reps"."id" = $1 LIMIT 1  [["id", 1]]