app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."twitter_handle" = $1 LIMIT 1  [["twitter_handle", "iamadell"]]
INSERT INTO "users" ("twitter_handle", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["twitter_handle", "@moon"], ["name", "Jamal"], ["created_at", "2015-03-06 19:20:17.120533"], ["updated_at", "2015-03-06 19:20:17.120533"]]
UPDATE "users" SET "oauth_token" = $1, "oauth_secret" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["oauth_token", "47278571-Sf2m2t6RaKGz1cM6JpnDv97wg9LRDOAwwPQUbgpJf"], ["oauth_secret", "rk6chh9pu966qZuX3GejFCKOrs7SUj6M2zpDQz0CrMKSL"], ["updated_at", "2015-03-06 19:23:13.133131"], ["id", 2]]
---
  def create
    puts auth_object = request.env['omniauth.auth']
    auth_info = request.env['omniauth.auth'].info
    raw_info = request.env['omniauth.auth'].extra.raw_info
    name = auth_info.name
    uid = auth_object.uid
    puts profile_pic_thumb_url = raw_info.profile_image_url_https
    puts profile_pic_big_url = auth_info.image
    twitter_handle = auth_info.nickname

    unless user = User.find_by(twitter_handle: twitter_handle)
      user = User.create(
        twitter_handle: twitter_handle,
        uid: uid,
        )
  end

  # update or creates user's attributes
  user.name = name
  user.profile_pic_thumb_url = profile_pic_thumb_url
  user.profile_pic_big_url = profile_pic_big_url
  session[:user_id] = user.id
  user.oauth_token = auth_object.credentials.token
  user.oauth_secret = auth_object.credentials.secret

  user.save!