app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    puts "hitting users/:id route -- User ID: #{params[:id]}"
    @user = User.find(params[:id])